name: "HSICNNNet"
layer {
  name: "HSI"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN  
  }
  transform_param{
    scale:0.005
  }
  data_param {
    source: "/home/para/caffe/examples/HSI/datasets/SA/HSITrainlmdb/"
    batch_size: 10
    backend:LMDB
  }
}
layer {
  name: "HSI"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  data_param {
    source: "/home/para/caffe/examples/HSI/datasets/SA/HSITestlmdb/"
    batch_size: 10827
    backend:LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  
  convolution_param {
    num_output: 20
    kernel_h:1
    kernel_w:918
    stride_h:1
    stride_w:1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value:0
    }
  }
}

layer {
    name:"tanhforConv"
    type:"TanH"
    bottom:"conv1"
    top:"conv1"
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
#    kernel_size:2
    kernel_h:1
    kernel_w:17
    stride_h:1
    stride_w:17
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool1"
  top: "ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 100
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
    name:"tanh2"
    type:"TanH"
    bottom:"ip1"
    top:"ip1"
}

layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 16
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
